---
type: MEPAnalyticalModelData
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 12
tags: [revit-api, class]
---

# MEPAnalyticalModelData

`Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData` · Revit 2024 · 12 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetMEPAnalyticalModelData | 2024 | `public static MEPAnalyticalModelData GetMEPAnalyticalModelData ( Element pElement )` |
| Method | GetNodeById | 2024 | `public MEPAnalyticalNode GetNodeById ( int nodeId )` |
| Method | GetNodeByIndex | 2024 | `public MEPAnalyticalNode GetNodeByIndex ( int index )` |
| Method | GetNumberOfNodes | 2024 | `public int GetNumberOfNodes ()` |
| Method | GetNumberOfSegments | 2024 | `public int GetNumberOfSegments ()` |
| Method | GetSegmentById | 2024 | `public MEPAnalyticalSegment GetSegmentById ( int segmentId )` |
| Method | GetSegmentByIndex | 2024 | `public MEPAnalyticalSegment GetSegmentByIndex ( int index )` |
| Method | GetSegmentData | 2024 | `public MEPNetworkSegmentData GetSegmentData ( int segmentId )` |
| Method | IsValidNodeId | 2024 | `public bool IsValidNodeId ( int nodeId )` |
| Method | IsValidSegmentId | 2024 | `public bool IsValidSegmentId ( int segmentId )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |